andrewleech/micropython/ports/stm32/main.c
    return true;
}
#endif

#if MICROPY_HW_SDCARD_MOUNT_AT_BOOT
static bool init_sdcard_fs(void) {
    bool first_part = true;
    for (int part_num = 1; part_num <= 5; ++part_num) {
        // create vfs object
        fs_user_mount_t *vfs_fat = m_new_obj_maybe(fs_user_mount_t);
        mp_vfs_mount_t *vfs = m_new_obj_maybe(mp_vfs_mount_t);
        if (vfs == NULL || vfs_fat == NULL) {
            break;
        }
        vfs_fat->blockdev.flags = MP_BLOCKDEV_FLAG_FREE_OBJ;
        if (part_num == 5) {
            if (!first_part) {
                break;
            }
            // partitions 1-4 couldn't be mounted, so try FATFS auto-detect mode
            // which will work if there is no partition table, just a filesystem
            sdcard_init_vfs(vfs_fat, 0);
        } else {
            sdcard_init_vfs(vfs_fat, part_num);
        }

        // try to mount the partition
        FRESULT res = f_mount(&vfs_fat->fatfs);

        if (res != FR_OK) {
            // couldn't mount
            m_del_obj(fs_user_mount_t, vfs_fat);
            m_del_obj(mp_vfs_mount_t, vfs);
        } else {
            // mounted via FatFs, now mount the SD partition in the VFS
            if (first_part) {
                // the first available partition is traditionally called "sd" for simplicity
                vfs->str = "/sd";
                vfs->len = 3;
            } else {
                // subsequent partitions are numbered by their index in the partition table
                if (part_num == 2) {
                    vfs->str = "/sd2";
                } else if (part_num == 3) {
                    vfs->str = "/sd3";
                } else {
                    vfs->str = "/sd4";
                }
                vfs->len = 4;
            }
            vfs->obj = MP_OBJ_FROM_PTR(vfs_fat);
            vfs->next = NULL;
            for (mp_vfs_mount_t **m = &MP_STATE_VM(vfs_mount_table);; m = &(*m)->next) {
                if (*m == NULL) {
                    *m = vfs;
                    break;
                }
            }

            #if MICROPY_HW_USB_MSC
            if (pyb_usb_storage_medium == PYB_USB_STORAGE_MEDIUM_NONE) {
                // if no USB MSC medium is selected then use the SD card
                pyb_usb_storage_medium = PYB_USB_STORAGE_MEDIUM_SDCARD;
            }

            // only use SD card as current directory if that's what the USB medium is
            if (pyb_usb_storage_medium == PYB_USB_STORAGE_MEDIUM_SDCARD)
            #endif
            {
                if (first_part) {
                    // use SD card as current directory
                    MP_STATE_PORT(vfs_cur) = vfs;
                }
            }
            first_part = false;
        }
    }

    if (first_part) {
        mp_printf(&mp_plat_print, "MPY: can't mount SD card\n");
        return false;
    } else {
        return true;
    }
}
#endif

#if MICROPY_ZEPHYR_THREADING
// Static heap for Zephyr threading builds to avoid overlap with thread stacks
// Thread stacks go into .noinit section after .bss, so we use a static array in .bss
// This ensures clear separation between heap and thread stack memory regions
// NUCLEO_F429ZI has 192KB RAM total. Heap size reduced to accommodate idle thread
// stacks (~2.5KB for idle + ISR stacks) when MICROPY_ZEPHYR_USE_IDLE_THREAD=1
#define MICROPY_HEAP_SIZE (42 * 1024)
static char heap[MICROPY_HEAP_SIZE];

// Zephyr threading entry point - called by Zephyr kernel after z_cstart()
// This function runs in z_main_thread context after kernel initialization
void micropython_main_thread_entry(void *p1, void *p2, void *p3) {
    (void)p1;
    (void)p2;
    (void)p3;

    // NOTE: We're now running in z_main_thread context, not boot/dummy context
    // This means k_thread_create() and other threading operations are safe

    // Initialize board state for main loop
    boardctrl_state_t state;
    state.reset_mode = 1;  // Normal boot for Zephyr entry
    state.log_soft_reset = false;

    MICROPY_BOARD_BEFORE_SOFT_RESET_LOOP(&state);

    // Jump into main soft reset loop (reuse existing code path)
    // This is implemented by calling into the soft_reset section of stm32_main
    // For now, we'll just implement the main loop directly here
    goto micropython_soft_reset;

micropython_soft_reset:
    MICROPY_BOARD_TOP_SOFT_RESET_LOOP(&state);

    // Threading early init - Phase 1 (set thread-local state FIRST)
    // Must be called before ANY code that accesses MP_STATE_THREAD()
    // This includes mp_cstack_init_with_top() and gc_init()
    if (!mp_thread_init_early()) {
        mp_printf(&mp_plat_print, "Failed to initialize threading (early phase)\n");
        for (;;) {}
    }

    // Stack limit init (symbols declared in gccollect.h)
    // Requires thread-local state to be set (accesses MP_STATE_THREAD)
    // With PSP switch, main thread runs on z_main_stack, not MSP (_sstack/_estack)
    extern struct k_thread z_main_thread;
    char *stack_top = (char *)(z_main_thread.stack_info.start + z_main_thread.stack_info.size);
    size_t stack_size = z_main_thread.stack_info.size;
    mp_cstack_init_with_top(stack_top, stack_size);

    // GC init with static heap (avoids overlap with thread stacks in .noinit section)
    gc_init(heap, heap + sizeof(heap));

    // Threading init - Phase 2 (allocate main thread on GC heap)
    // Requires GC to be initialized for m_new_obj() heap allocation
    char stack_dummy;
    if (!mp_thread_init(&stack_dummy)) {
        mp_printf(&mp_plat_print, "Failed to initialize threading (phase 2)\n");
        for (;;) {}
    }

    // THEN enable SysTick interrupt now that threading is fully initialized
    extern void mp_zephyr_arch_enable_systick_interrupt(void);
    mp_zephyr_arch_enable_systick_interrupt();

    #if MICROPY_ENABLE_PYSTACK
    static mp_obj_t pystack[384];
    mp_pystack_init(pystack, &pystack[384]);
    #endif

    // MicroPython init
    mp_init();

    // Initialise low-level sub-systems
    readline_init0();
    pin_init0();
    extint_init0();
    timer_init0();

    #if MICROPY_HW_ENABLE_CAN
    pyb_can_init0();
    #endif

    #if MICROPY_HW_ENABLE_USB
    pyb_usb_init0();
    #endif

    #if MICROPY_PY_MACHINE_I2S
    machine_i2s_init0();
    #endif

